KCX-Mapping-Convert/testdaten/ICS/CZ/uids-err.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
  <soap:Header>
    <Header xmlns="http://www.eurtradenet.com/schemas/header/200809">
      <To>CZ01.EK.TST</To>
      <From>CZ01.EK.TST</From>
      <MessageID>08fb6d1d-a171-4ebc-9bce-5503546d4ddd</MessageID>
      <InReplyTo>17693302510-2EVPVDT</InReplyTo>
      <SentAt>2011-02-20T08:11:22</SentAt>
      <Act>inform</Act>
      <Procedure>ICS</Procedure>
      <MessageType>ICSDeclarationRejected</MessageType>
      <Direction>TO_CUSTOMER</Direction>
      <MessageVersion>1.0</MessageVersion>
    </Header>
  </soap:Header>
  <soap:Body>
    <Submit xmlns="http://www.eurtradenet.com/schemas/uids/ics/body/200911">
      <ICS>
        <ICSDeclarationRejected>
          <LocalReferenceNumber>17693302510-2EVPVDT</LocalReferenceNumber>
          <Error>
            <Type>7:Value does not exist in the classifier</Type>
            <Pointer>HEADER.CONSIGNEE.Country</Pointer>
            <Reason>ZEME_D</Reason>
            <OriginalValue>RS</OriginalValue>
          </Error>
          <Error>
            <Type>8:Inconsistency with the rule</Type>
            <Pointer>HEADER.CONSIGNOR.Postcode</Pointer>
            <Reason>C501_TCR:IF 'TIN' is present in the data group (and thus known by EORI) THEN this attribute is optional ELSE this attribute is required.</Reason>
          </Error>
          <Error>
            <Type>8:Inconsistency with the rule</Type>
            <Pointer>HEADER.CONSIGNEE.Postcode</Pointer>
            <Reason>C501_TCE:IF 'TIN' is present in the data group (and thus known by EORI) THEN this attribute is optional ELSE this attribute is required.</Reason>
          </Error>
        </ICSDeclarationRejected>
      </ICS>
    </Submit>
  </soap:Body>
</soap:Envelope>
